---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedTransparent.SurfaceNdfType
source: html/431eef57-2346-9a75-5167-c47146b862ad.htm
---
# Autodesk.Revit.DB.Visual.AdvancedTransparent.SurfaceNdfType Property

The property labeled "NDF" from the "AdvancedTransparent" schema.

## Syntax (C#)
```csharp
public static string SurfaceNdfType { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "SurfaceNdfType".